# WallSide Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..WallSide Property
WallSweepInfo Class See Also
---
The side of the wall to which the sweep or reveal is attached.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WallSide WallSide { get; set; }
```

Visual Basic
---
```text
Public Property WallSide As WallSide
	Get
	Set
```

Visual C++
---
```text
public:
property WallSide WallSide {
	WallSide get ();
	void set (WallSide value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace